CkovMk/HITSIC_MK66F18/HITSIC_MK66F18_IAR/components/codec/sgtl5000/fsl_sgtl5000.h
/*
 * Copyright (c) 2015, Freescale Semiconductor, Inc.
 * Copyright 2016-2019 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _FSL_SGTL5000_H_
#define _FSL_SGTL5000_H_

#include "fsl_codec_i2c.h"

/*!
 * @addtogroup sgtl5000
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/
/*! @name Driver version */
/*@{*/
/*! @brief CLOCK driver version 2.1.0. */
#define FSL_SGTL5000_DRIVER_VERSION (MAKE_VERSION(2, 1, 0))
/*@}*/

/*! @brief Define the register address of sgtl5000. */
#define CHIP_ID 0x0000
#define CHIP_DIG_POWER 0x0002
#define CHIP_CLK_CTRL 0x0004
#define CHIP_I2S_CTRL 0x0006
#define CHIP_SSS_CTRL 0x000A
#define CHIP_ADCDAC_CTRL 0x000E
#define CHIP_DAC_VOL 0x0010
#define CHIP_PAD_STRENGTH 0x0014
#define CHIP_ANA_ADC_CTRL 0x0020
#define CHIP_ANA_HP_CTRL 0x0022
#define CHIP_ANA_CTRL 0x0024
#define CHIP_LINREG_CTRL 0x0026
#define CHIP_REF_CTRL 0x0028
#define CHIP_MIC_CTRL 0x002A
#define CHIP_LINE_OUT_CTRL 0x002C
#define CHIP_LINE_OUT_VOL 0x002E
#define CHIP_ANA_POWER 0x0030
#define CHIP_PLL_CTRL 0x0032
#define CHIP_CLK_TOP_CTRL 0x0034
#define CHIP_ANA_STATUS 0x0036
#define CHIP_ANA_TEST2 0x003A
#define CHIP_SHORT_CTRL 0x003C
#define SGTL5000_DAP_CONTROL 0x0100
#define SGTL5000_DAP_PEQ 0x0102
#define SGTL5000_DAP_BASS_ENHANCE 0x0104
#define SGTL5000_DAP_BASS_ENHANCE_CTRL 0x0106
#define SGTL5000_DAP_AUDIO_EQ 0x0108
#define SGTL5000_DAP_SGTL_SURROUND 0x010A
#define SGTL5000_DAP_FILTER_COEF_ACCESS 0x010C
#define SGTL5000_DAP_COEF_WR_B0_MSB 0x010E
#define SGTL5000_DAP_COEF_WR_B0_LSB 0x0110
#define SGTL5000_DAP_AUDIO_EQ_BASS_BAND0 0x0116
#define SGTL5000_DAP_AUDIO_EQ_BAND1 0x0118
#define SGTL5000_DAP_AUDIO_EQ_BAND2 0x011A
#define SGTL5000_DAP_AUDIO_EQ_BAND3 0x011C
#define SGTL5000_DAP_AUDIO_EQ_TREBLE_BAND4 0x011E
#define SGTL5000_DAP_MAIN_CHAN 0x0120
#define SGTL5000_DAP_MIX_CHAN 0x0122
#define SGTL5000_DAP_AVC_CTRL 0x0124
#define SGTL5000_DAP_AVC_THRESHOLD 0x0126
#define SGTL5000_DAP_AVC_ATTACK 0x0128
#define SGTL5000_DAP_AVC_DECAY 0x012A
#define SGTL5000_DAP_COEF_WR_B1_MSB 0x012C
#define SGTL5000_DAP_COEF_WR_B1_LSB 0x012E
#define SGTL5000_DAP_COEF_WR_B2_MSB 0x0130
#define SGTL5000_DAP_COEF_WR_B2_LSB 0x0132
#define SGTL5000_DAP_COEF_WR_A1_MSB 0x0134
#define SGTL5000_DAP_COEF_WR_A1_LSB 0x0136
#define SGTL5000_DAP_COEF_WR_A2_MSB 0x0138
#define SGTL5000_DAP_COEF_WR_A2_LSB 0x013A

/*
 * Field Definitions.
 */

/*
 * SGTL5000_CHIP_DIG_POWER
 */
#define SGTL5000_ADC_ENABLE_CLR_MASK 0xFFBF
#define SGTL5000_ADC_ENABLE_GET_MASK 0x0040
#define SGTL5000_ADC_ENABLE_SHIFT 0x6
#define SGTL5000_DAC_ENABLE_CLR_MASK 0xFFDF
#define SGTL5000_DAC_ENABLE_GET_MASK 0x0020
#define SGTL5000_DAC_ENABLE_SHIFT 0x5
#define SGTL5000_DAP_ENABLE_CLR_MASK 0xFFEF
#define SGTL5000_DAP_ENABLE_GET_MASK 0x0010
#define SGTL5000_DAP_ENABLE_SHIFT 0x4
#define SGTL5000_I2S_OUT_ENABLE_CLR_MASK 0xFFFD
#define SGTL5000_I2S_OUT_ENABLE_GET_MASK 0x0002
#define SGTL5000_I2S_OUT_ENABLE_SHIFT 0x1
#define SGTL5000_I2S_IN_ENABLE_CLR_MASK 0xFFFE
#define SGTL5000_I2S_IN_ENABLE_GET_MASK 0x0001
#define SGTL5000_I2S_IN_ENABLE_SHIFT 0x0

/*
 * SGTL5000_CHIP_CLK_CTRL
 */
#define SGTL5000_RATE_MODE_CLR_MASK 0xFFCF
#define SGTL5000_RATE_MODE_GET_MASK 0x0030
#define SGTL5000_RATE_MODE_SHIFT 0x4
#define SGTL5000_RATE_MODE_DIV_1 0x0000
#define SGTL5000_RATE_MODE_DIV_2 0x0010
#define SGTL5000_RATE_MODE_DIV_4 0x0020
#define SGTL5000_RATE_MODE_DIV_6 0x0030
#define SGTL5000_SYS_FS_CLR_MASK 0xFFF3
#define SGTL5000_SYS_FS_GET_MASK 0x000C
#define SGTL5000_SYS_FS_SHIFT 0x2
#define SGTL5000_SYS_FS_32k 0x0000
#define SGTL5000_SYS_FS_44_1k 0x0004
#define SGTL5000_SYS_FS_48k 0x0008
#define SGTL5000_SYS_FS_96k 0x000C
#define SGTL5000_MCLK_FREQ_CLR_MASK 0xFFFC
#define SGTL5000_MCLK_FREQ_GET_MASK 0x0003
#define SGTL5000_MCLK_FREQ_SHIFT 0x0
#define SGTL5000_MCLK_FREQ_256FS 0x0000
#define SGTL5000_MCLK_FREQ_384FS 0x0001
#define SGTL5000_MCLK_FREQ_512FS 0x0002
#define SGTL5000_MCLK_FREQ_PLL 0x0003

/*
 * SGTL5000_CHIP_I2S_CTRL
 */
#define SGTL5000_I2S_SLCKFREQ_CLR_MASK 0xFEFF
#define SGTL5000_I2S_SCLKFREQ_GET_MASK 0x0100
#define SGTL5000_I2S_SCLKFREQ_SHIFT 0x8
#define SGTL5000_I2S_SCLKFREQ_64FS 0x0000
#define SGTL5000_I2S_SCLKFREQ_32FS 0x0100 /* Not for RJ mode */
#define SGTL5000_I2S_MS_CLR_MASK 0xFF7F
#define SGTL5000_I2S_MS_GET_MASK 0x0080
#define SGTL5000_I2S_MS_SHIFT 0x7
#define SGTL5000_I2S_MASTER 0x0080
#define SGTL5000_I2S_SLAVE 0x0000
#define SGTL5000_I2S_SCLK_INV_CLR_MASK 0xFFBF
#define SGTL5000_I2S_SCLK_INV_GET_MASK 0x0040
#define SGTL5000_I2S_SCLK_INV_SHIFT 0x6
#define SGTL5000_I2S_VAILD_FALLING_EDGE 0x0040
#define SGTL5000_I2S_VAILD_RISING_EDGE 0x0000
#define SGTL5000_I2S_DLEN_CLR_MASK 0xFFCF
#define SGTL5000_I2S_DLEN_GET_MASK 0x0030
#define SGTL5000_I2S_DLEN_SHIFT 0x4
#define SGTL5000_I2S_DLEN_32 0x0000
#define SGTL5000_I2S_DLEN_24 0x0010
#define SGTL5000_I2S_DLEN_20 0x0020
#define SGTL5000_I2S_DLEN_16 0x0030
#define SGTL5000_I2S_MODE_CLR_MASK 0xFFF3
#define SGTL5000_I2S_MODE_GET_MASK 0x000C
#define SGTL5000_I2S_MODE_SHIFT 0x2
#define SGTL5000_I2S_MODE_I2S_LJ 0x0000
#define SGTL5000_I2S_MODE_RJ 0x0004
#define SGTL5000_I2S_MODE_PCM 0x0008
#define SGTL5000_I2S_LRALIGN_CLR_MASK 0xFFFD
#define SGTL5000_I2S_LRALIGN_GET_MASK 0x0002
#define SGTL5000_I2S_LRALIGN_SHIFT 0x1
#define SGTL5000_I2S_ONE_BIT_DELAY 0x0000
#define SGTL5000_I2S_NO_DELAY 0x0002
#define SGTL5000_I2S_LRPOL_CLR_MASK 0xFFFE
#define SGTL5000_I2S_LRPOL_GET_MASK 0x0001
#define SGTL5000_I2S_LRPOL_SHIFT 0x0
#define SGTL5000_I2S_LEFT_FIRST 0x0000
#define SGTL5000_I2S_RIGHT_FIRST 0x0001

/*
 * SGTL5000_CHIP_SSS_CTRL
 */
#define SGTL5000_DAP_MIX_LRSWAP_CLR_MASK 0xBFFF
#define SGTL5000_DAP_MIX_LRSWAP_GET_MASK 0x4000
#define SGTL5000_DAP_MIX_LRSWAP_SHIFT 0xE
#define SGTL5000_DAP_LRSWAP_CLR_MASK 0xDFFF
#define SGTL5000_DAP_LRSWAP_GET_MASK 0x2000
#define SGTL5000_DAP_LRSWAP_SHIFT 0xD
#define SGTL5000_DAC_LRSWAP_CLR_MASK 0xEFFF
#define SGTL5000_DAC_LRSWAP_GET_MASK 0x1000
#define SGTL5000_DAC_LRSWAP_SHIFT 0xC
#define SGTL5000_I2S_LRSWAP_CLR_MASK 0xFBFF
#define SGTL5000_I2S_LRSWAP_GET_MASK 0x0400
#define SGTL5000_I2S_LRSWAP_SHIFT 0xA
#define SGTL5000_DAP_MIX_SEL_CLR_MASK 0xFCFF
#define SGTL5000_DAP_MIX_SEL_GET_MASK 0x0300
#define SGTL5000_DAP_MIX_SEL_SHIFT 0x8
#define SGTL5000_DAP_MIX_SEL_ADC 0x0000
#define SGTL5000_DAP_MIX_SEL_I2S_IN 0x0100
#define SGTL5000_DAP_SEL_CLR_MASK 0xFF3F
#define SGTL5000_DAP_SEL_GET_MASK 0x00C0
#define SGTL5000_DAP_SEL_SHIFT 0x6
#define SGTL5000_DAP_SEL_ADC 0x0000
#define SGTL5000_DAP_SEL_I2S_IN 0x0040
#define SGTL5000_DAC_SEL_CLR_MASK 0xFFCF
#define SGTL5000_DAC_SEL_GET_MASK 0x0030
#define SGTL5000_DAC_SEL_SHIFT 0x4
#define SGTL5000_DAC_SEL_ADC 0x0000
#define SGTL5000_DAC_SEL_I2S_IN 0x0010
#define SGTL5000_DAC_SEL_DAP 0x0030
#define SGTL5000_I2S_OUT_SEL_CLR_MASK 0xFFFC
#define SGTL5000_I2S_OUT_SEL_GET_MASK 0x0003
#define SGTL5000_I2S_OUT_SEL_SHIFT 0x0
#define SGTL5000_I2S_OUT_SEL_ADC 0x0000
#define SGTL5000_I2S_OUT_SEL_I2S_IN 0x0001
#define SGTL5000_I2S_OUT_SEL_DAP 0x0003

