CkovMk/HITSIC_MK66F18/HITSIC_MK66F18_IAR/components/codec/sgtl5000/fsl_sgtl5000.h
/*
 * SGTL5000_CHIP_ADCDAC_CTRL
 */
#define SGTL5000_VOL_BUSY_DAC_RIGHT 0x2000
#define SGTL5000_VOL_BUSY_DAC_LEFT 0x1000
#define SGTL5000_DAC_VOL_RAMP_EN_CLR_MASK 0xFDFF
#define SGTL5000_DAC_VOL_RAMP_EN_GET_MASK 0x0200
#define SGTL5000_DAC_VOL_RAMP_EN_SHIFT 0x9
#define SGTL5000_DAC_VOL_RAMP_EXPO_CLR_MASK 0xFEFF
#define SGTL5000_DAC_VOL_RAMP_EXPO_GET_MASK 0x0100
#define SGTL5000_DAC_VOL_RAMP_EXPO_SHIFT 0x8
#define SGTL5000_DAC_MUTE_RIGHT_CLR_MASK 0xFFF7
#define SGTL5000_DAC_MUTE_RIGHT_GET_MASK 0x0008
#define SGTL5000_DAC_MUTE_RIGHT_SHIFT 0x3
#define SGTL5000_DAC_MUTE_LEFT_CLR_MASK 0xFFFB
#define SGTL5000_DAC_MUTE_LEFT_GET_MASK 0x0004
#define SGTL5000_DAC_MUTE_LEFT_SHIFT 0x2
#define SGTL5000_ADC_HPF_FREEZE_CLR_MASK 0xFFFD
#define SGTL5000_ADC_HPF_FREEZE_GET_MASK 0x0002
#define SGTL5000_ADC_HPF_FREEZE_SHIFT 0x1
#define SGTL5000_ADC_HPF_BYPASS_CLR_MASK 0xFFFE
#define SGTL5000_ADC_HPF_BYPASS_GET_MASK 0x0001
#define SGTL5000_ADC_HPF_BYPASS_SHIFT 0x0

/*
 * SGTL5000_CHIP_DAC_VOL
 */
#define SGTL5000_DAC_VOL_RIGHT_CLR_MASK 0x00FF
#define SGTL5000_DAC_VOL_RIGHT_GET_MASK 0xFF00
#define SGTL5000_DAC_VOL_RIGHT_SHIFT 0x8
#define SGTL5000_DAC_VOL_LEFT_CLR_MASK 0xFF00
#define SGTL5000_DAC_VOL_LEFT_GET_MASK 0x00FF
#define SGTL5000_DAC_VOL_LEFT_SHIFT 0x0

/*
 * SGTL5000_CHIP_PAD_STRENGTH
 */
#define SGTL5000_PAD_I2S_LRCLK_CLR_MASK 0xFCFF
#define SGTL5000_PAD_I2S_LRCLK_GET_MASK 0x0300
#define SGTL5000_PAD_I2S_LRCLK_SHIFT 0x8
#define SGTL5000_PAD_I2S_SCLK_CLR_MASK 0xFF3F
#define SGTL5000_PAD_I2S_SCLK_GET_MASK 0x00C0
#define SGTL5000_PAD_I2S_SCLK_SHIFT 0x6
#define SGTL5000_PAD_I2S_DOUT_CLR_MASK 0xFFCF
#define SGTL5000_PAD_I2S_DOUT_GET_MASK 0x0030
#define SGTL5000_PAD_I2S_DOUT_SHIFT 0x4
#define SGTL5000_PAD_I2C_SDA_CLR_MASK 0xFFF3
#define SGTL5000_PAD_I2C_SDA_GET_MASK 0x000C
#define SGTL5000_PAD_I2C_SDA_SHIFT 0x2
#define SGTL5000_PAD_I2C_SCL_CLR_MASK 0xFFFC
#define SGTL5000_PAD_I2C_SCL_GET_MASK 0x0003
#define SGTL5000_PAD_I2C_SCL_SHIFT 0x0

/*
 * SGTL5000_CHIP_ANA_ADC_CTRL
 */
#define SGTL5000_ADC_VOL_M6DB_CLR_MASK 0xFEFF
#define SGTL5000_ADC_VOL_M6DB_GET_MASK 0x0100
#define SGTL5000_ADC_VOL_M6DB_SHIFT 0x8
#define SGTL5000_ADC_VOL_RIGHT_CLR_MASK 0xFF0F
#define SGTL5000_ADC_VOL_RIGHT_GET_MASK 0x00F0
#define SGTL5000_ADC_VOL_RIGHT_SHIFT 0x4
#define SGTL5000_ADC_VOL_LEFT_CLR_MASK 0xFFF0
#define SGTL5000_ADC_VOL_LEFT_GET_MASK 0x000F
#define SGTL5000_ADC_VOL_LEFT_SHIFT 0x0

/*
 * SGTL5000_CHIP_ANA_HP_CTRL
 */
#define SGTL5000_HP_VOL_RIGHT_CLR_MASK 0x80FF
#define SGTL5000_HP_VOL_RIGHT_GET_MASK 0x7F00
#define SGTL5000_HP_VOL_RIGHT_SHIFT 0x8
#define SGTL5000_HP_VOL_LEFT_CLR_MASK 0xFF80
#define SGTL5000_HP_VOL_LEFT_GET_MASK 0x007F
#define SGTL5000_HP_VOL_LEFT_SHIFT 0x0

/*
 * SGTL5000_CHIP_ANA_CTRL
 */
#define SGTL5000_MUTE_LO_GET_MASK 0x0100
#define SGTL5000_MUTE_LO_CLR_MASK 0xFEFF
#define SGTL5000_MUTE_LO_SHIFT 0x8
#define SGTL5000_SEL_HP_GET_MASK 0x0040
#define SGTL5000_SEL_HP_CLR_MASK 0xFFBF
#define SGTL5000_SEL_HP_SHIFT 0x6
#define SGTL5000_SEL_HP_DAC 0x0000
#define SGTL5000_SEL_HP_LINEIN 0x0040
#define SGTL5000_EN_ZCD_HP_GET_MASK 0x0020
#define SGTL5000_EN_ZCD_HP_CLR_MASK 0xFFDF
#define SGTL5000_EN_ZCD_HP_SHIFT 0x5
#define SGTL5000_MUTE_HP_GET_MASK 0x0010
#define SGTL5000_MUTE_HP_CLR_MASK 0xFFEF
#define SGTL5000_MUTE_HP_SHIFT 0x4
#define SGTL5000_SEL_ADC_GET_MASK 0x0004
#define SGTL5000_SEL_ADC_CLR_MASK 0xFFFB
#define SGTL5000_SEL_ADC_SHIFT 0x2
#define SGTL5000_SEL_ADC_MIC 0x0000
#define SGTL5000_SEL_ADC_LINEIN 0x0004
#define SGTL5000_EN_ZCD_ADC_GET_MASK 0x0002
#define SGTL5000_EN_ZCD_ADC_CLR_MASK 0xFFFD
#define SGTL5000_EN_ZCD_ADC_SHIFT 0x1
#define SGTL5000_MUTE_ADC_GET_MASK 0x0001
#define SGTL5000_MUTE_ADC_CLR_MASK 0xFFFE
#define SGTL5000_MUTE_ADC_SHIFT 0x0

/*
 * SGTL5000_CHIP_LINREG_CTRL
 */
#define SGTL5000_VDDC_MAN_ASSN_CLR_MASK 0xFFBF
#define SGTL5000_VDDC_MAN_ASSN_GET_MASK 0x0040
#define SGTL5000_VDDC_MAN_ASSN_SHIFT 0x6
#define SGTL5000_VDDC_MAN_ASSN_VDDA 0x0000
#define SGTL5000_VDDC_MAN_ASSN_VDDIO 0x0040
#define SGTL5000_VDDC_ASSN_OVRD 0x0020
#define SGTL5000_LINREG_VDDD_CLR_MASK 0xFFF0
#define SGTL5000_LINREG_VDDD_GET_MASK 0x000F
#define SGTL5000_LINREG_VDDD_SHIFT 0x0

/*
 * SGTL5000_CHIP_REF_CTRL
 */
#define SGTL5000_ANA_GND_MASK 0x01f0
#define SGTL5000_ANA_GND_SHIFT 0x4
#define SGTL5000_ANA_GND_WIDTH 0x5
#define SGTL5000_ANA_GND_BASE 0x320 /* mv */
#define SGTL5000_ANA_GND_STP 0x19   /*mv */
#define SGTL5000_BIAS_CTRL_MASK 0x000e
#define SGTL5000_BIAS_CTRL_SHIFT 0x1
#define SGTL5000_BIAS_CTRL_WIDTH 0x3
#define SGTL5000_SMALL_POP 0x0001

/*
 * SGTL5000_CHIP_MIC_CTRL
 */
#define SGTL5000_BIAS_R__CLR_MASK 0xFCFF
#define SGTL5000_BIAS_R_GET_MASK 0x0300
#define SGTL5000_BIAS_R_SHIFT 0x8
#define SGTL5000_BIAS_R_off 0x0000
#define SGTL5000_BIAS_R_2K 0x0100
#define SGTL5000_BIAS_R_4k 0x0200
#define SGTL5000_BIAS_R_8k 0x0300
#define SGTL5000_BIAS_VOLT_CLR_MASK 0xFF8F
#define SGTL5000_BIAS_VOLT_GET_MASK 0x0070
#define SGTL5000_BIAS_VOLT_SHIFT 0x4
#define SGTL5000_MIC_GAIN_CLR_MASK 0xFFFC
#define SGTL5000_MIC_GAIN_GET_MASK 0x0003
#define SGTL5000_MIC_GAIN_SHIFT 0x0

/*
 * SGTL5000_CHIP_LINE_OUT_CTRL
 */
#define SGTL5000_LINE_OUT_CURRENT_CLR_MASK 0xF0FF
#define SGTL5000_LINE_OUT_CURRENT_GET_MASK 0x0F00
#define SGTL5000_LINE_OUT_CURRENT_SHIFT 0x8
#define SGTL5000_LINE_OUT_CURRENT_180u 0x0000
#define SGTL5000_LINE_OUT_CURRENT_270u 0x0100
#define SGTL5000_LINE_OUT_CURRENT_360u 0x0300
#define SGTL5000_LINE_OUT_CURRENT_450u 0x0700
#define SGTL5000_LINE_OUT_CURRENT_540u 0x0F00
#define SGTL5000_LINE_OUT_GND_CLR_MASK 0xFFC0
#define SGTL5000_LINE_OUT_GND_GET_MASK 0x003F
#define SGTL5000_LINE_OUT_GND_SHIFT 0x0
#define SGTL5000_LINE_OUT_GND_BASE 0x320 /* mv */
#define SGTL5000_LINE_OUT_GND_STP 0x19
#define SGTL5000_LINE_OUT_GND_MAX 0x23

/*
 * SGTL5000_CHIP_LINE_OUT_VOL
 */
#define SGTL5000_LINE_OUT_VOL_RIGHT_CLR_MASK 0xE0FF
#define SGTL5000_LINE_OUT_VOL_RIGHT_GET_MASK 0x1F00
#define SGTL5000_LINE_OUT_VOL_RIGHT_SHIFT 0x8
#define SGTL5000_LINE_OUT_VOL_LEFT_CLR_MASK 0xFFE0
#define SGTL5000_LINE_OUT_VOL_LEFT_GET_MASK 0x001F
#define SGTL5000_LINE_OUT_VOL_LEFT_SHIFT 0x0

